# IntegerRange Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntegerRange Class
Members See Also
---
A class to define a range of a sequence of consecutive integer numbers
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class IntegerRange : IDisposable
```

Visual Basic
---
```text
Public Class IntegerRange _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IntegerRange : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..IntegerRange
# See Also
IntegerRange Members
Autodesk.Revit.DB Namespace